 
 [
 {
        "objectID": "1",
        "imgSrc": "/images/image1.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "The Fear of Man is a Snare.",
        "preview": "A believer can fail to mature in their walk with God because of an inability to say no to people and draw boundaries. When people benefit from your lack of boundaries, you inevitably get drained and you feel used. But when you finally muster up courage and draw the requisite boundaries, some of these people who were benefitting from your…"
    },
    {
        "objectID": "2",
        "imgSrc": "/images/image2.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "The War on Children: How and When to Talk to your Children about Sex",
        "preview": "Ernest Wamboye delivers a webinar on how and when to talk to your children about sex."
    },
    {
        "objectID": "3",
        "imgSrc": "/images/image3.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "Dealing with Sexual Addictions: Kabarak University",
        "preview": "Ernest Wamboye speaks to students at the Christian Union at Kabarak University on the subject of dealing with sexual addictions."
    },
    {
        "objectID": "4",
        "imgSrc": "/images/image4.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "The War on Children Series: Sex, Screens and Secrets",
        "preview": "Ernest Wamboye teaches on handling the digital influence on your teen and preteen with wisdom."
    },
    {
        "objectID": "5",
        "imgSrc": "/images/image5.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "7 things parents should do to stop destroying their children’s future marriages",
        "preview": "This year, we will clock the 1,000 mark as far as taking couples through premarital counselling is concerned. We are currently at 970. That is 1940 individuals. We have done this over four years via twelve seasons of premarital classes. When you interact with nearly 1,000 couples who are about to enter the marriage institution, you learn a few things.…"
    },
    {
        "objectID": "6",
        "imgSrc": "/images/image6.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "Forgive as you have been forgiven",
        "preview": "A few thoughts from my quiet time today morning. I am studying the sermon on the mount in the book of Matthew by our Lord Jesus. When he gets to the Lord’s prayer He teaches this: “Forgive us our debts as we forgive our debtors.” Jesus ties the request for God’s forgiveness to our extension of forgiveness to others. One…"
    },
    {
        "objectID": "7",
        "imgSrc": "/images/image7.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "12 things I have learned from 12 years of marriage",
        "preview": "On the 1st of September 2012, Waturi and I exchanged our vows on the lawns of Brackenhurst Limuru. How a dozen years have passed by befuddles me! The journey has peaked north and sunk south. The net effect has been a grateful journey that I would not wish to take with anyone else but Waturi. In the good and the…"
    },
     {
        "objectID": "8",
        "imgSrc": "/images/image8.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "Strategies for Spiritual Warfare: Do not go beyond what is written",
        "preview": "‭‭1 Corinthians‬ ‭4‬:‭6‬ “Now, brothers and sisters, I have applied these things to myself and Apollos for your benefit, so that you may learn from us the meaning of the saying, “Do not go beyond what is written.” Then you will not be puffed up in being a follower of one of us over against the other.” (NIV‬‬) One key…"
    },
    {
        "objectID": "9",
        "imgSrc": "/images/image9.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "Clean the Pulpit: Why compromised Kenyan pastors should learn from Rwanda 🇷🇼",
        "preview": "Two weeks ago, I was preaching in Kigali, Rwanda 🇷🇼. I preached in the country’s biggest English speaking congregation. It’s called Christian Life Assembly (CLA) church. The church is located in the city and attracts many wealthy individuals and expatriates. The church also attracts many politicians. I had done preachings on Friday and Saturday because of the Father’s Day weekend…"
    },
    {
        "objectID": "10",
        "imgSrc": "/images/image10.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "The Fool in Proverbs",
        "preview": "The Bible dedicates a whole book to specifically call out foolishness. I have attempted to draw out every portion of Proverbs that addresses the fool. I will summarise the lesson for each mention of the fool and leave the reference. This list can help you run a quick self-diagnosis to see if you are a fool in the eyes of…"
    },
    {
        "objectID": "11",
        "imgSrc": "/images/image11.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "The Passive and Active Wrath of God",
        "preview": "Bible history teaches us that the wrath of God is often preceded by a lull. Before Noah’s ark was filled and sealed, the people on earth were consumed with the everyday activities of life- marriage, work, entertainment etc. Then the flood came. Before the destruction of Sodom and Gomorrah, the people were in deep self indulgence and consumed with their…"
    },
    {
        "objectID": "12",
        "imgSrc": "/images/image12.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "God-given Identity",
        "preview": "Bible history teaches us that the wrath of God is often preceded by a lull. Before Noah’s ark was filled and sealed, the people on earth were consumed with the everyday activities of life- marriage, work, entertainment etc. Then the flood came. Before the destruction of Sodom and Gomorrah, the people were in deep self indulgence and consumed with their…"
    },
    {
        "objectID": "13",
        "imgSrc": "/images/image13.webp",
        "imgAlt": "Picture of Joseph.",
        "date": "07 Sept 2023",
        "href": "/",
        "title": "Precious Remedies Against Satan’s Devices",
        "preview": "In 2 Corinthians 2:11Open in Logos Bible Software (if available) Paul says that believers should not be ignorant of Satan’s devices. The word Satan means adversary. His other name the Devil means a liar. To put the two together (adversary and liar), it is axiomatic that our enemy opposes us through deception. This is also evident from scripture. Revelation 12:9Open in Logos Bible Software (if available) ”So the great dragon was cast…"
    }
]
  